jnsbyr/esp8266-intexsbh20/PureSpaIO.cpp
    if (tries && state.buzzer)
    {
      return true;
    }
    else
    {
      DEBUG_MSG("\ncWT fail");
    }
  }

  return false;
}

uint16 PureSpaIO::convertDisplayToCelsius(uint32 value) const
{
  uint16 celsiusValue = display2Num(value);
  char tempUnit = display2LastDigit(value);
  if (tempUnit == 'F')
  {
    // convert °F to °C
    float fValue = (float)celsiusValue;
    celsiusValue = (uint16)round(((fValue - 32) * 5) / 9);
  }
  else if (tempUnit != 'C')
  {
    celsiusValue = UNDEF::USHORT;
  }

  return (celsiusValue >= 0) && (celsiusValue <= 60) ? celsiusValue : UNDEF::USHORT;
}

ICACHE_RAM_ATTR void PureSpaIO::clockRisingISR(void* arg)
{
  bool data = !digitalRead(PIN::DATA);
  bool enable = digitalRead(PIN::LATCH) == LOW;

/*
  PureSpaIO* sbh20io = (PureSpaIO*)arg;
  volatile State& state = sbh20io->state;
  volatile IsrState& isrState = sbh20io->isrState;
*/

  if (enable || isrState.receivedBits == (FRAME::BITS - 1))
  {
    isrState.frameValue = (isrState.frameValue << 1) + data;
    isrState.receivedBits++;

    if (isrState.receivedBits == FRAME::BITS)
    {
      state.frameCounter++;
      if (isrState.frameValue == FRAME_TYPE::CUE)
      {
        // cue frame, ignore
        //DEBUG_MSG("\nC");
      }
      else if (isrState.frameValue & FRAME_TYPE::DIGIT)
      {
        // display frame
        //DEBUG_MSG("\nD");
        decodeDisplay();
      }
      else if (isrState.frameValue & FRAME_TYPE::LED)
      {
        // LED frame
        //DEBUG_MSG("\nL");
        decodeLED();
      }
      else if (isrState.frameValue & FRAME_TYPE::BUTTON)
      {
        // button frame
        //DEBUG_MSG("\nB");
        decodeButton();
      }
      else if (isrState.frameValue != 0)
      {
        // unsupported frame
        //DEBUG_MSG("\nU");
      }

      isrState.receivedBits = 0;
    }
  }
  else
  {
    //DEBUG_MSG(" %d ", receivedBits);
    isrState.receivedBits = 0;
    state.frameCounter++;
  }
}

ICACHE_RAM_ATTR inline void PureSpaIO::decodeDisplay()
{
  char digit;
  switch (isrState.frameValue & FRAME_DIGIT::SEGMENTS)
  {
    case FRAME_DIGIT::OFF:
      digit = DIGIT::OFF;
      break;
    case FRAME_DIGIT::NUM_0:
      digit = '0';
      break;
    case FRAME_DIGIT::NUM_1:
      digit = '1';
      break;
    case FRAME_DIGIT::NUM_2:
      digit = '2';
      break;
    case FRAME_DIGIT::NUM_3:
      digit = '3';
      break;
    case FRAME_DIGIT::NUM_4:
      digit = '4';
      break;
    case FRAME_DIGIT::NUM_5:
      digit = '5';
      break;
    case FRAME_DIGIT::NUM_6:
      digit = '6';
      break;
    case FRAME_DIGIT::NUM_7:
      digit = '7';
      break;
    case FRAME_DIGIT::NUM_8:
      digit = '8';
      break;
    case FRAME_DIGIT::NUM_9:
      digit = '9';
      break;
    case FRAME_DIGIT::LET_C:
      digit = 'C'; // temp unit °C
      break;
    case FRAME_DIGIT::LET_D:
      digit = 'D';
      break;
    case FRAME_DIGIT::LET_E:
      digit = 'E';
      break;
    case FRAME_DIGIT::LET_F:
      digit = 'F'; // temp unit °F
      break;
    case FRAME_DIGIT::LET_H:
      digit = 'H';
      break;
    case FRAME_DIGIT::LET_N:
      digit = 'N';
      break;

    default:
      // unsupported, ignore
      return;
  }

  switch (isrState.frameValue & FRAME_TYPE::DIGIT)
  {
    case FRAME_DIGIT::POS_1:
      //DEBUG_MSG("1");
      isrState.displayValue = (isrState.displayValue & 0x00FFFFFFU) + (digit << 24);
      isrState.receivedDigits = DIGIT::POS_1;
      break;

    case FRAME_DIGIT::POS_2:
      //DEBUG_MSG("2");
      if (isrState.receivedDigits == DIGIT::POS_1)
      {
        isrState.displayValue = (isrState.displayValue & 0xFF00FFFFU) + (digit << 16);
        isrState.receivedDigits |= DIGIT::POS_2;
      }
      break;

    case FRAME_DIGIT::POS_3:
      //DEBUG_MSG("3");
      if (isrState.receivedDigits == DIGIT::POS_1_2)
      {
        isrState.displayValue = (isrState.displayValue & 0xFFFF00FFU) + (digit << 8);
        isrState.receivedDigits |= DIGIT::POS_3;
      }
      break;

    case FRAME_DIGIT::POS_4:
      //DEBUG_MSG("4");
      if (isrState.receivedDigits == DIGIT::POS_1_2_3)
      {
        isrState.displayValue = (isrState.displayValue & 0xFFFFFF00U) + digit;
        isrState.receivedDigits = DIGIT::POS_ALL;
      }
      break;
  }

  if (isrState.receivedDigits == DIGIT::POS_ALL)
  {
    if (isrState.displayValue == isrState.latestDisplayValue)
    {
      // display is stable, might be blinking
      //DEBUG_MSG(" s%x", isrState.displayValue);
      isrState.stableDisplayValueCount--;
      if (isrState.stableDisplayValueCount == 0)
      {
        //DEBUG_MSG("S%x ", isrState.displayValue);
        isrState.stableDisplayValueCount = CONFIRM_FRAMES::DISP;
        //DEBUG_MSG("O");
        if (isrState.isDisplayBlinking)
        {
          if (diff(state.frameCounter, isrState.lastBlankDisplayFrameCounter) > BLINK::STOPPED_FRAMES)
          {
            // blinking is over, clear desired temp
            //DEBUG_MSG("b");
            isrState.isDisplayBlinking = false;
            isrState.latestBlinkingTemp = UNDEF::UINT;
          }
        }

        if (!displayIsError(isrState.displayValue))
        {
          // display does not show an error
          //DEBUG_MSG("e");
          if (displayIsTemp(isrState.displayValue))
          {
            // display shows a temperature
            //DEBUG_MSG("T");
            if (isrState.isDisplayBlinking)
            {
              // display is blinking
              if (isrState.displayValue == isrState.latestBlinkingTemp)
              {
                // blinking temp is stable
                isrState.stableBlinkingWaterTempCount++;
                //DEBUG_MSG(" DS%d ", isrState.stableDesiredWaterTempCount);
              }
              else if (diff(state.frameCounter, isrState.lastBlankDisplayFrameCounter) < BLINK::TEMP_FRAMES)
              {
                // blinking temp has changed (is read after a blank screen and set at next black screen)
                //DEBUG_MSG(" DC%x ", isrState.displayValue);
                isrState.latestBlinkingTemp = isrState.displayValue;
                isrState.stableBlinkingWaterTempCount = 0;
              }
            }
            else
            {
              // display is not blinking
              if (isrState.displayValue == isrState.latestWaterTemp)
              {
                // new actual temp is stable
                //DEBUG_MSG("A%d", stableWaterTempCount);
                isrState.stableWaterTempCount--;
                if (isrState.stableWaterTempCount == 0)
                {
                  // save actual temp
                  if (state.waterTemp != isrState.displayValue)
                  {
                    //DEBUG_MSG(" AT ");
                    state.waterTemp = isrState.displayValue;
                  }

                  // get temp unit
                  char tempUnit = display2LastDigit(isrState.displayValue);
                  if (tempUnit != isrState.latestTempUnit)
                  {
                    isrState.latestTempUnit = tempUnit;
                  }

                  isrState.stableWaterTempCount = CONFIRM_FRAMES::WATER_TEMP_ACT;

